src/cf/InformationRegisters/ктв_ИспользованиеИменЛогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ктв_ИспользованиеИменЛогов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СпособЛогирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ктв_СпособыЛогирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЛога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ктв_Логирование/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование". (Основной модуль)
//
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныеПроцедуры


#КонецОбласти 

#Область ОбработкаЛогирования

// Процедура выполняет запись в лог
//
Функция ПолучитьСпособыЛогирования(ИмяЛога) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	ИспользованиеИменЛогов.СпособЛогирования КАК СпособЛогирования
	                      |ИЗ
	                      |	РегистрСведений.ктв_ИспользованиеИменЛогов КАК ИспользованиеИменЛогов
	                      |ГДЕ
	                      |	ИспользованиеИменЛогов.ИмяЛога = &ИмяЛога
	                      |	ИЛИ ИспользованиеИменЛогов.СпособЛогирования.ИспользоватьДляВсех");
	
	Запрос.УстановитьПараметр("ИмяЛога", ИмяЛога);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("СпособЛогирования");
	
КонецФункции //ПолучитьСпособыЛогирования()

// Процедура выполняет запись в лог
//
Процедура ЗаписатьВЛог(ИмяЛога, УровеньЛога, Текст, ПараметрыЗаписи) Экспорт
	
	СпособыЛогирования = ПолучитьСпособыЛогирования(ИмяЛога);
	
	Для Каждого ТекСпособ Из СпособыЛогирования Цикл
		ЗаписатьВЛогПоСпособуЛогирования(ТекСпособ, ИмяЛога, УровеньЛога, Текст, ПараметрыЗаписи);
	КонецЦикла;
	
КонецПроцедуры //ЗаписатьВЛог()

// Процедура выполняет запись в лог
//
Процедура ЗаписатьВЛогПоСпособуЛогирования(СпособЛогирования, ИмяЛога, УровеньЛога, Текст, ПараметрыЗаписи) Экспорт
	
	ВремОбработка = СпособЛогирования.Обработка.Получить();
	ВремОбработка = ?(ТипЗнч(ВремОбработка) = Тип("Строка"), ВремОбработка, ПолучитьНавигационнуюСсылку(СпособЛогирования, "Обработка"));
	
	ОбработкаОбъект = ктв_ОбработкиОбслуживания.ПолучитьОбработкуОбъект(ВремОбработка);
	
	ТекстОшибки = "";
	
	Попытка
		
		Результат = Неопределено;
		
		Результат = ОбработкаОбъект.ЗаписатьВЛог(ИмяЛога, УровеньЛога, Текст, ПараметрыЗаписи);
		
		Если ПараметрыЗаписи.Свойство("ТекстОшибки") Тогда
			ТекстОшибки = ПараметрыЗаписи.ТекстОшибки;
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если ПараметрыЗаписи.Свойство("ТекстОшибки") Тогда
			ПараметрыЗаписи.ТекстОшибки = ПараметрыЗаписи.ТекстОшибки + Символы.ПС + ТекстОшибки;
		Иначе
			ПараметрыЗаписи.Вставить("ТекстОшибки", ТекстОшибки);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры //ЗаписатьВЛогПоСпособуЛогирования()

#КонецОбласти
